In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./resources/salaries.csv')

In [3]:
df

     name  salary  age
0    asif  120000   56
1  faisal   30000   40
2     evo   40000   32

In [4]:
df['salary']

0    120000
1     30000
2     40000
Name: salary, dtype: int64

In [5]:
# to get more than one coloum use two third bracket
# **** Two third bracket ***
df[['age', ' name']]

   age    name
0   56    asif
1   40  faisal
2   32     evo

In [6]:
# we can use most of the numpy function in pandas
df['salary'].max()

120000

In [7]:
# get the basic statistical info of the dataframe
df.describe()

              salary        age
count       3.000000   3.000000
mean    63333.333333  42.666667
std     49328.828623  12.220202
min     30000.000000  32.000000
25%     35000.000000  36.000000
50%     40000.000000  40.000000
75%     80000.000000  48.000000
max    120000.000000  56.000000

In [8]:
# boolean filter
df['salary'] > 35000

0     True
1    False
2     True
Name: salary, dtype: bool

In [9]:
# use boolean filter in the dataframe
df[df['salary'] > 35000]

   name  salary  age
0  asif  120000   56
2   evo   40000   32

In [10]:
# convert to numpy array from pandas's dataframe. 
matrix = df.as_matrix()
matrix

/home/mithun/anaconda3/envs/tfdeeplearning/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Method .as_matrix will be removed in a future version. Use .values instead.

array([['asif', 120000, 56],
       ['faisal', 30000, 40],
       ['evo', 40000, 32]], dtype=object)

In [11]:
type(matrix)

numpy.ndarray